./sdriver.pl -t trace14.txt -s ./tsh -a "-p"
#
# trace14.txt - Simple error handling
#
cmdline       :   /bin/echo tsh> ./bogus
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   000000000000000010010000000000000000

0000000000000000000000000000
child process
pid: (20002)cmdline: /bin/echo tsh> ./bogus
tsh> ./bogus
sigchld handle call
退出值为 0
childhandle pid: 20002
cmdline       :   ./bogus
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   00000000000000001001000000000000000000000000000000000

00000000000
child process
pid: (20003)cmdline: ./bogus
cmdline       :   /bin/echo -e tsh> ./myspin 4 \046
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20003)
before suspend:   0000000000000000100100000000000000000000000000

000000000000000000
child process
pid: (20004)cmdline: /bin/echo -e tsh> ./myspin 4 \046
tsh> ./myspin 4 &
sigstophandle
Job [1] (20003) stoped by signal 20
cmdline       :   /bin/echo -e tsh> ./myspin 4 \046
cmdline       :   /bin/echo -e tsh> ./myspin 4 \046
sigchld handle call
by stoped
childhandle pid: 20003
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   000000000000000010010000000000000

0000000000000000000child process
pid: (20013)00cmdline: /bin/echo -e tsh> ./myspin 4 \046
0000000000
tsh> ./myspin 4 &
sigchld handle call
退出值为 0
childhandle pid: 20013
cmdline       :   ./myspin 4 &
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
runbgggggg
[2] (20014) ./myspin 4 &
cmdline       :   /bin/echo tsh> fg
first mask    :   010000000000000010010000000000

0000000000000child process
pid: (20014)00cmdline: ./myspin 4 &
0000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   0000000000000000100100000

000000000000000000child process
pid: (20015)00cmdline: /bin/echo tsh> fg
0000000000000000000
tsh> fg
sigchld handle call
退出值为 0
childhandle pid: 20015
cmdline       :   fg
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000
fg command requeires PID or %jobid argument
cmdline       :   /bin/echo tsh> bg
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   0000000000000000100100000000

00000000000000000child process
pid: (20016)00cmdline: /bin/echo tsh> bg
00000000000000000
tsh> bg
sigchld handle call
退出值为 0
childhandle pid: 20016
cmdline       :   bg
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000
bg command requeires PID or %jobid argument
cmdline       :   /bin/echo tsh> fg a
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   00000000000000001001000000000000000

000000000000000child process
pid: (20017)00cmdline: /bin/echo tsh> fg a
000000000000
tsh> fg a
sigchld handle call
退出值为 0
childhandle pid: 20017
cmdline       :   fg a
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000
fg: argument must be a PID or %jobid
cmdline       :   /bin/echo tsh> bg a
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   00000000000000001

0010000000000000child process
pid: (20018)0cmdline: /bin/echo tsh> bg a
000000000000000000000000000000
tsh> bg a
sigchld handle call
退出值为 0
childhandle pid: 20018
cmdline       :   bg a
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000
bg: argument must be a PID or %jobid
cmdline       :   /bin/echo tsh> fg 9999999
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   000000000000000010010

00000000000000000child process
pid: (20019)0cmdline: /bin/echo tsh> fg 9999999
0000000000000000000000000
tsh> fg 9999999
sigchld handle call
退出值为 0
childhandle pid: 20019
cmdline       :   fg 9999999
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000
No such process
cmdline       :   /bin/echo tsh> bg 9999999
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   00000000000000001001000000000000000

00000000000000000000000child process
pid: (20020)00cmdline: /bin/echo tsh> bg 9999999
0000
tsh> bg 9999999
sigchld handle call
退出值为 0
childhandle pid: 20020
cmdline       :   bg 9999999
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000
No such process
cmdline       :   /bin/echo tsh> fg %2
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000

father process pid: (20001)
before suspend:   000000000000000010010000000000000

0000000000000000000child process
pid: (20021)00cmdline: /bin/echo tsh> fg %2
0000000000
tsh> fg %2
sigchld handle call
退出值为 0
childhandle pid: 20021
cmdline       :   fg %2
first mask    :   0100000000000000100100000000000000000000000000000000000000000000
prev          :   0000000000000000000000000000000000000000000000000000000000000000
sigchld handle call
退出值为 0
childhandle pid: 20014